### Terraform `plan` Succeeded for Workspace: `default` 
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_internet_gateway.igw has been deleted
-   resource "aws_internet_gateway" "igw" {
-       arn      = "arn:aws:ec2:ap-southeast-1:851725426915:internet-gateway/igw-0509b27d518da5303" -> null
-       id       = "igw-0509b27d518da5303" -> null
-       owner_id = "851725426915" -> null
-       tags     = {
-           "Name" = "staging-igw"
        } -> null
-       tags_all = {
-           "Name" = "staging-igw"
        } -> null
-       vpc_id   = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_nat_gateway.nat has been deleted
-   resource "aws_nat_gateway" "nat" {
-       allocation_id                      = "eipalloc-001fa074907acc561" -> null
-       association_id                     = "eipassoc-011d83e81f7770729" -> null
-       connectivity_type                  = "public" -> null
-       id                                 = "nat-0ae2bd7490e53bd41" -> null
-       network_interface_id               = "eni-04c94a93419785652" -> null
-       private_ip                         = "10.0.69.213" -> null
-       public_ip                          = "13.228.186.51" -> null
-       secondary_private_ip_address_count = 0 -> null
-       secondary_private_ip_addresses     = [] -> null
-       subnet_id                          = "subnet-0b91f1ddf5129e016" -> null
-       tags                               = {
-           "Name" = "staging-nat"
        } -> null
-       tags_all                           = {
-           "Name" = "staging-nat"
        } -> null
    }

  # aws_route_table.private has been deleted
-   resource "aws_route_table" "private" {
-       arn              = "arn:aws:ec2:ap-southeast-1:851725426915:route-table/rtb-0a83e2231782c8d23" -> null
-       id               = "rtb-0a83e2231782c8d23" -> null
-       owner_id         = "851725426915" -> null
-       propagating_vgws = [] -> null
-       route            = [
-           {
-               carrier_gateway_id         = ""
-               cidr_block                 = "0.0.0.0/0"
-               core_network_arn           = ""
-               destination_prefix_list_id = ""
-               egress_only_gateway_id     = ""
-               gateway_id                 = ""
-               ipv6_cidr_block            = ""
-               local_gateway_id           = ""
-               nat_gateway_id             = "nat-0ae2bd7490e53bd41"
-               network_interface_id       = ""
-               transit_gateway_id         = ""
-               vpc_endpoint_id            = ""
-               vpc_peering_connection_id  = ""
            },
        ] -> null
-       tags             = {
-           "Name" = "staging-private"
        } -> null
-       tags_all         = {
-           "Name" = "staging-private"
        } -> null
-       vpc_id           = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_route_table.public has been deleted
-   resource "aws_route_table" "public" {
-       arn              = "arn:aws:ec2:ap-southeast-1:851725426915:route-table/rtb-0338e512ab5e9fe34" -> null
-       id               = "rtb-0338e512ab5e9fe34" -> null
-       owner_id         = "851725426915" -> null
-       propagating_vgws = [] -> null
-       route            = [
-           {
-               carrier_gateway_id         = ""
-               cidr_block                 = "0.0.0.0/0"
-               core_network_arn           = ""
-               destination_prefix_list_id = ""
-               egress_only_gateway_id     = ""
-               gateway_id                 = "igw-0509b27d518da5303"
-               ipv6_cidr_block            = ""
-               local_gateway_id           = ""
-               nat_gateway_id             = ""
-               network_interface_id       = ""
-               transit_gateway_id         = ""
-               vpc_endpoint_id            = ""
-               vpc_peering_connection_id  = ""
            },
        ] -> null
-       tags             = {
-           "Name" = "staging-public"
        } -> null
-       tags_all         = {
-           "Name" = "staging-public"
        } -> null
-       vpc_id           = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_route_table_association.private_zone1 has been deleted
-   resource "aws_route_table_association" "private_zone1" {
-       id             = "rtbassoc-0171f43b4645faf07" -> null
-       route_table_id = "rtb-0a83e2231782c8d23" -> null
-       subnet_id      = "subnet-0ee3eb1a4e66966ec" -> null
    }

  # aws_route_table_association.private_zone2 has been deleted
-   resource "aws_route_table_association" "private_zone2" {
-       id             = "rtbassoc-0b40c1d6f92b913b4" -> null
-       route_table_id = "rtb-0a83e2231782c8d23" -> null
-       subnet_id      = "subnet-0f0b265c7177f44cb" -> null
    }

  # aws_route_table_association.public_zone1 has been deleted
-   resource "aws_route_table_association" "public_zone1" {
-       id             = "rtbassoc-0ef635b699c3a9867" -> null
-       route_table_id = "rtb-0338e512ab5e9fe34" -> null
-       subnet_id      = "subnet-0b91f1ddf5129e016" -> null
    }

  # aws_route_table_association.public_zone2 has been deleted
-   resource "aws_route_table_association" "public_zone2" {
-       id             = "rtbassoc-0369e7f14a2a170e6" -> null
-       route_table_id = "rtb-0338e512ab5e9fe34" -> null
-       subnet_id      = "subnet-0aa50c89221739e0a" -> null
    }

  # aws_subnet.private_zone1 has been deleted
-   resource "aws_subnet" "private_zone1" {
-       arn                                            = "arn:aws:ec2:ap-southeast-1:851725426915:subnet/subnet-0ee3eb1a4e66966ec" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-southeast-1a" -> null
-       availability_zone_id                           = "apse1-az1" -> null
-       cidr_block                                     = "10.0.0.0/19" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0ee3eb1a4e66966ec" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "851725426915" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"                               = "staging-private-ap-southeast-1a"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/internal-elb"    = "1"
        } -> null
-       tags_all                                       = {
-           "Name"                               = "staging-private-ap-southeast-1a"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/internal-elb"    = "1"
        } -> null
-       vpc_id                                         = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_subnet.private_zone2 has been deleted
-   resource "aws_subnet" "private_zone2" {
-       arn                                            = "arn:aws:ec2:ap-southeast-1:851725426915:subnet/subnet-0f0b265c7177f44cb" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-southeast-1b" -> null
-       availability_zone_id                           = "apse1-az2" -> null
-       cidr_block                                     = "10.0.32.0/19" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0f0b265c7177f44cb" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "851725426915" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"                               = "staging-private-ap-southeast-1b"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/internal-elb"    = "1"
        } -> null
-       tags_all                                       = {
-           "Name"                               = "staging-private-ap-southeast-1b"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/internal-elb"    = "1"
        } -> null
-       vpc_id                                         = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_subnet.public_zone1 has been deleted
-   resource "aws_subnet" "public_zone1" {
-       arn                                            = "arn:aws:ec2:ap-southeast-1:851725426915:subnet/subnet-0b91f1ddf5129e016" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-southeast-1a" -> null
-       availability_zone_id                           = "apse1-az1" -> null
-       cidr_block                                     = "10.0.64.0/19" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0b91f1ddf5129e016" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = true -> null
-       owner_id                                       = "851725426915" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"                               = "staging-public-ap-southeast-1a"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/elb"             = "1"
        } -> null
-       tags_all                                       = {
-           "Name"                               = "staging-public-ap-southeast-1a"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/elb"             = "1"
        } -> null
-       vpc_id                                         = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_subnet.public_zone2 has been deleted
-   resource "aws_subnet" "public_zone2" {
-       arn                                            = "arn:aws:ec2:ap-southeast-1:851725426915:subnet/subnet-0aa50c89221739e0a" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-southeast-1b" -> null
-       availability_zone_id                           = "apse1-az2" -> null
-       cidr_block                                     = "10.0.96.0/19" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0aa50c89221739e0a" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = true -> null
-       owner_id                                       = "851725426915" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       tags                                           = {
-           "Name"                               = "staging-public-ap-southeast-1b"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/elb"             = "1"
        } -> null
-       tags_all                                       = {
-           "Name"                               = "staging-public-ap-southeast-1b"
-           "kubernetes.io/cluster/staging-demo" = "owned"
-           "kubernetes.io/role/elb"             = "1"
        } -> null
-       vpc_id                                         = "vpc-0fd55f033213dc19a" -> null
    }

  # aws_vpc.main has been deleted
-   resource "aws_vpc" "main" {
-       arn                                  = "arn:aws:ec2:ap-southeast-1:851725426915:vpc/vpc-0fd55f033213dc19a" -> null
-       assign_generated_ipv6_cidr_block     = false -> null
-       cidr_block                           = "10.0.0.0/16" -> null
-       default_network_acl_id               = "acl-093d2d0c8c8df5b96" -> null
-       default_route_table_id               = "rtb-09695c33c7873a718" -> null
-       default_security_group_id            = "sg-04f18baaac1f76532" -> null
-       dhcp_options_id                      = "dopt-08162a72e739706c1" -> null
-       enable_dns_hostnames                 = true -> null
-       enable_dns_support                   = true -> null
-       enable_network_address_usage_metrics = false -> null
-       id                                   = "vpc-0fd55f033213dc19a" -> null
-       instance_tenancy                     = "default" -> null
-       ipv6_netmask_length                  = 0 -> null
-       main_route_table_id                  = "rtb-09695c33c7873a718" -> null
-       owner_id                             = "851725426915" -> null
-       tags                                 = {
-           "Name" = "staging-main"
        } -> null
-       tags_all                             = {
-           "Name" = "staging-main"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_internet_gateway.igw will be created
+   resource "aws_internet_gateway" "igw" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "staging-igw"
        }
+       tags_all = {
+           "Name" = "staging-igw"
        }
+       vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat will be created
+   resource "aws_nat_gateway" "nat" {
+       allocation_id                      = "eipalloc-001fa074907acc561"
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "staging-nat"
        }
+       tags_all                           = {
+           "Name" = "staging-nat"
        }
    }

  # aws_route_table.private will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = ""
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = (known after apply)
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
+       tags             = {
+           "Name" = "staging-private"
        }
+       tags_all         = {
+           "Name" = "staging-private"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = (known after apply)
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
+       tags             = {
+           "Name" = "staging-public"
        }
+       tags_all         = {
+           "Name" = "staging-public"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_zone1 will be created
+   resource "aws_route_table_association" "private_zone1" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_zone2 will be created
+   resource "aws_route_table_association" "private_zone2" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_zone1 will be created
+   resource "aws_route_table_association" "public_zone1" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_zone2 will be created
+   resource "aws_route_table_association" "public_zone2" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.private_zone1 will be created
+   resource "aws_subnet" "private_zone1" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-southeast-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/19"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                               = "staging-private-ap-southeast-1a"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/internal-elb"    = "1"
        }
+       tags_all                                       = {
+           "Name"                               = "staging-private-ap-southeast-1a"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/internal-elb"    = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_zone2 will be created
+   resource "aws_subnet" "private_zone2" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-southeast-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.32.0/19"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                               = "staging-private-ap-southeast-1b"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/internal-elb"    = "1"
        }
+       tags_all                                       = {
+           "Name"                               = "staging-private-ap-southeast-1b"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/internal-elb"    = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_zone1 will be created
+   resource "aws_subnet" "public_zone1" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-southeast-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.64.0/19"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                               = "staging-public-ap-southeast-1a"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/elb"             = "1"
        }
+       tags_all                                       = {
+           "Name"                               = "staging-public-ap-southeast-1a"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/elb"             = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_zone2 will be created
+   resource "aws_subnet" "public_zone2" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-southeast-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.96.0/19"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                               = "staging-public-ap-southeast-1b"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/elb"             = "1"
        }
+       tags_all                                       = {
+           "Name"                               = "staging-public-ap-southeast-1b"
+           "kubernetes.io/cluster/staging-demo" = "owned"
+           "kubernetes.io/role/elb"             = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "staging-main"
        }
+       tags_all                             = {
+           "Name" = "staging-main"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>